["Here are the key points from the provided text:\n\n* Compucom Institute of Technology & Management, Jaipur\n* Gaurav Lalwani, CTC: 10.00\n* Jitendra Chandani, CTC: 6.25\n* Nidhi Gurjar, CTC: 5.85\n* Sohel Baig Mirza, CTC: 7.50\n* Nirbhay Dosi, CTC: 10.80\n* Honey Sharma, CTC: 11.10\n* Yamini Choudhary, CTC: 14.00\n* Aamir sohaib, CTC: 15.00\n* Atul Parashar, CTC: 17.00\n* Bhupesh sharma, CTC: 24.00\n* Career Mandatory Disclosure 2023-24 RTU Syllabus\n* MIS Login\n* AICTE approved, affiliated to RTU, Kota\n* Toll Free No. 1800-8900-750\n* Focus on customized industry collaboration and making students job-ready\n* 11000+ alumni, 5600+ placed students, 7100+ job offers, 62 LPA highest package offered, 389+ recruiters\n* Facilities & Infrastructure: Auditorium, sports facilities, library, hostel, student corner, value-added courses\n* Approval & Affiliation: Women, girls grievance, anti-ragging committee, internal committee, SC ST committee, quality assurance cell\n* Training and Assessment Partner: Excellence Center\n* Bhupesh sharma, MBA Technical Lead, CTC 24.00 LPA\n* Atul Parashar, MBA Software Developer, CTC 17.00 LPA\n* Aamir sohaib, B.Tech CS Software Developer, CTC 15.00 LPA\n* Yamini Choudhary, B.Tech CS Senior Test Engineer, CTC 14.00 LPA\n* Honey Sharma, Btech cs Backend Developer, CTC 11.10 LPA\n* Nirbhay Dosi, B.tech cs Nirbhay Dosi, CTC 10.80 LPA\n* Nidhi Gurjar, B.Tech CS Mern Stack Developer, CTC 5.85 LPA\n* Sohel Baig Mirza, MBA Software Developer, CTC 7.50 LPA\n* Jitendra Chandani, MBA Process Associate, CTC 6.25 LPA\n* Placement Drive Events: SMAC DIGITAL, Thinker Technology, Zordial Technologies, Briskminds Software Solutions, Doomshell Softwares Private Limited, Sirus Infotech, DriftPoint Technologies Pvt. Ltd., Flipshope, Entity Digital Sports Pvt Ltd, View more\n* Compucom Institute of Technology & Management, Jaipur, is a well-reputed institution for Professional Studies (B.Tech, MBA, M. Tech) in Rajasthan.\n* Approved by AICTE, Ministry of Human Resource Development, Government of India and affiliated to Rajasthan Technical University.\n* Sister organization - Compucom Software Limited has the honor of being the only recipient in the entire State of Rajasthan, of the Best Performance Award from the Government of India & Government of Rajasthan for exporting IT / Softwares to USA and other countries.\n* Principal Message: Dr. Akash Saxena, Principal.", "* AIETM is a engineering college located in Jaipur, India.\n* It has industry contacts, experienced faculty, and a stimulating learning environment.\n* The college aims to produce well-rounded professionals who can lead and drive change in the 21st century.\n* AIETM offers the following undergraduate courses:\n\t+ Civil Engineering (90 seats)\n\t+ Computer Science Engineering (60 seats)\n\t+ Electrical Engineering (60 seats)\n\t+ Mechanical Engineering (90 seats)\n* The college has a strong focus on employability skills and has a dedicated Training & Placement cell.\n* It has a 7-year history and over 10,000 alumni.\n* The college has a good placement record with over 250 campus drives and 600 computers.\n* Students have praised the college for its faculty, courseware, and infrastructure.\n* The college has a strong industry alliance and is located in Jaipur, Rajasthan.\n* Contact information:\n\t+ Address: F-29, Omaxe City, Ajmer Road, Jaipur (Rajasthan) - 302026\n\t+ Phone: 0141-5140402\n\t+ Mobile: 084321-00111\n\t+ Email: [admission@aryacollege.org](mailto:admission@aryacollege.org)\n\t+ Quick Links: Courses Offered, Campus Placement, Student Corner, Arya Notes, Contact Us, Pay Fee, Alumni.", "* GIT Jaipur is a top private engineering college in Jaipur, Rajasthan\n* Approved by AICTE, New Delhi and affiliated to RTU, Kota\n* Recognized as one of the top engineering institutes in Rajasthan and ranked 'A' by RTU, Kota\n* Accredited twice by NAAC\n* Offers B.Tech courses in Computer Science Engineering, IT, Mechanical Engineering, Civil Engineering, and Electrical Engineering\n* Also offers AI & Data Science courses\n* Has a Department of Applied Science\n* Provides student support through Center of Excellence, Atal Incubation Centre, Alumni Cell, and Coe Celebal Technologies\n* High placement rate with top recruiters including Infosys, Capegemini, L&T, Nagaro, Bosch, IBM, AutoPe, Epam, and Amazon\n* Offers scholarships based on 12th percentage and JEE scores\n* State-of-the-art infrastructure with central library, high speed Wi-Fi, theatre style classrooms, research and development cell, incubation centre, and training and placement cell\n* Led by experienced faculty members and strong leadership committed to providing quality education and contributing to human development through academic pursuits.", "* Compucom Institute of Technology & Management in Jaipur, approved by AICTE and affiliated to RTU, offers professional studies (B.Tech, MBA, M. Tech)\n* The college is promoted by Compucom Software Ltd., listed in NSE & BSE\n* It has been accredited by NAAC committee of University Grants Commission\n* Over 11,000 alumni and 5,600 placed students\n* Highest package offered: 62 LPA\n* Over 389 recruiters\n* Facilities include auditorium, sports facilities, library, hostel, and more\n* Approval & Affiliation: Women Girls Grievance, Student Grievance Redressal Cell, Anti Ragging committee & Helpline, Internal Committee, SC ST Committee, Quality Assurance Cell\n* Training and Assessment Partner: Excellence Center\n* Customize Industry Collaboration to make students job ready\n* Placement drives conducted by various companies\n* CTC of recent hires: Gaurav Lalwani - 10.00, Jitendra Chandani - 6.25, Nidhi Gurjar - 5.85, Sohel Baig Mirza - 7.50, Nirbhay Dosi - 10.80, Honey Sharma - 11.10, Yamini Choudhary - 14.00, Aamir sohaib - 15.00, Atul Parashar - 17.00, Bhupesh sharma - 24.00", "* AIETM is a engineering college located in Jaipur, India.\n* It has industry contacts, experienced faculty, and a stimulating learning environment.\n* The college aims to produce well-rounded professionals who can lead and drive change in the 21st century.\n* AIETM offers the following undergraduate courses:\n\t+ Civil Engineering (90 seats)\n\t+ Computer Science Engineering (60 seats)\n\t+ Electrical Engineering (60 seats)\n\t+ Mechanical Engineering (90 seats)\n* The college has a strong focus on employability skills and has had success in placing students in companies.\n* It has a 7-year history and over 10,000 alumni.\n* AIETM has a placement cell, student development cell, and entrepreneurship development cell to support students.\n* The college has state-of-the-art facilities including:\n\t+ Hostel\n\t+ Library\n\t+ ICT-enabled lecture theaters\n\t+ Computing facilities\n\t+ WiFi campus\n\t+ Sports facilities\n\t+ Transportation\n\t+ Cafeteria\n\t+ Gymnasium\n\t+ Auditorium\n\t+ OPD\n\t+ ATM\n\t+ Studio\n\t+ Bank loan assistance\n* AIETM has a strong track record of campus placements and has relationships with over 250 companies.\n* The college has received positive feedback from students and has a strong reputation in the industry.", "* GIT Jaipur is a top private engineering college in Jaipur, Rajasthan\n* Approved by AICTE, New Delhi and affiliated to RTU, Kota\n* Recognized as the Top Engineering Institutes in Rajasthan and Ranked 'A' by RTU, Kota\n* Accredited twice by NAAC\n* Offers various courses in Computer Science Engineering, IT, Mechanical Engineering, Civil Engineering, Electrical Engineering, and Applied Science\n* Has a Center of Excellence in AI and Atal Incubation Centre\n* Strong alumni network with successful professionals in various fields\n* Offers quality education with experienced faculty members, regular workshops, training, counseling, and a digital library\n* Has a green campus with students clubs and industry-academia environment\n* Highest package of 35 Lacs per annum offered\n* Offers practice-led vision with flourishing and engaged alumni.", "* Jaipur Engineering College (JEC) is a top engineering college in Jaipur.\n* Contact information: +91-8875071333, admission@jeckukas.org.in.\n* Admission open for 2024, apply now.\n* Offering virtual campus tour.\n* Grievance Redressal Form available.\n* Courses offered include B.Tech and M.Tech in various engineering branches.\n* Admission procedure includes REAP-2024.\n* Fee structure available.\n* Placement and entrepreneurship opportunities.\n* Training and summer internship programs.\n* Esteemed recruiters include DOIT, Infosys, RRV UNL, Central Board Excise & Custom, ISRO and more.\n* Linkages with professional bodies.\n* Outreach opportunities available.\n* Campus life includes engineering projects, academic achievers, committees, and sports.\n* Key teams and functions include administration, research cell, and training and placement.\n* Contact us for more information.\n* JEC believes in innovation and creativity for a better future of engineering.\n* JEC devotes special attention to major challenges and areas of scientific interest.\n* Programs are career-focused and delivered by passionate teachers.\n* Exposure to global opportunities.\n* JEC's placement cell supports each graduating student with best fit placement and internship.\n* Placement track record includes students placed in various industries with high CTC.\n* Some of the recruiters are DOIT, Infosys, RRV UNL, Central Board Excise & Custom, ISRO and more.\n* JEC's 360° flexible engineering approach encourages students to explore different academic avenues.\n* Broad-based foundation allows students to make meaningful connections and apply their education in the wider world.", "* IILM Academy of Higher Learning Jaipur is a top business school in Rajasthan, India.\n* Offers MBA and PGDM programs, as well as undergraduate programs in business and management.\n* Established in 2004, part of the Ram Krishan and Sons Charitable Trust.\n* Offers AICTE approved PGDM and BBA programs.\n* Curriculum is industry-driven and regularly updated.\n* Emphasis on experiential learning through business simulations, industry visits, and mentoring.\n* Full-time faculty with rich experience.\n* Also offers executive certificate programs in business analytics and digital marketing.\n* Campus facilities include a library, computer center, and sports facilities.\n* Strong placement record with reputable recruiters.\n* Admissions open for PGDM, BBA, and BCA programs for the 2024 batch.", "* Poornima Institute of Engineering & Technology (PIET) established in 2007\n* Motto: 'Success is not a destination, it's a journey'\n* 4th rank among Rajasthan Technical University (RTU) colleges\n* Over 10,000 students, 600 teachers and staff\n* 17+ years of experience, 100+ MOUs, 20+ industry partners\n* 20+ published patents, 15+ granted patents\n* Received ₹ 1.70 crore research grant\n* Over 150 SCI/Scopus publications, 150 UGC Care publications\n* Modern classrooms, labs, and halls\n* Notifications for:\n\t+ ISTE student awards 2023\n\t+ Minority and SC-ST-OBC grievance cells\n\t+ Scholarship renewals for PMSSS\n\t+ Semester examination reschedules\n\t+ Branch changes for B.Tech. students\n\t+ RTU revaluation and answer copy viewing\n\t+ Suspension letters\n\t+ Library book submission\n\t+ VIII Semester debarred list\n\t+ British Council Scholarship for Women in STEM\n\t+ Gandhi Jayanti and Shastri Jayanti celebrations\n\t+ SC-ST-OBC monitoring cell formation\n\t+ Centre city change for B.Tech. students\n\t+ Revised first midterm examination time table\n\t+ RTU examination notices\n\t+ Appointments for club activities and website updates\n\t+ Blood donation camps\n\t+ B.Tech. VI Sem. exams 2018-19\n\t+ Submission of examination and improvement forms"]